class Матеріали:
    def Матеріали(self):
        print(" 2 * 1 = 2\
                2 * 2 = 4\
                2 * 3 = 6\
                2 * 4 = 8\
                2 * 5 = 10\
                2 * 6 = 12\
                2 * 7 = 14\
                2 * 8 = 16\
                2 * 9 = 18\
                2 * 10 = 20  ")
        
class Завдання:
    def Завдання(self):
        input(" 2 * 1 = ")
        input(" 2 * 3 = ")
        input(" 2 * 5 = ")
        input(" 2 * 7 = ")
        input(" 2 * 9 = ")
                
class Передня_Обкладинка:
    def Передня_Обкладинка(self):
            print("___________________\
                   |                 |\
                   |   Математика    |\
                   |   2 клас        |\
                   |                 |\
                   |    2 * 2 = 4    |\
                   |                 |\
                   |                 |\
                   |    2024-2025    |\
                   |_________________|")         

class Задня_Обкладинка:
         def Передня_Обкладинка(self):
            print("___________________\
                   |                 |\
                   |  фіварф івааррі |\
                   |  вфаіва гіваів  |\
                   |  іва а іваів і  |\
                   |                 |\
                   |                 |\
                   |                 |\
                   | @Ucraine_Math24 |\
                   |_________________|")      
                                

                                